#웹 스크래핑 : 웹페이지에서 내가 원하는 부분만 떼오기  <<★해당 강의의 주 내용
#웹 크롤링 : 페이지에 있는 모든 내용 가져오기 // 허용범위 내에서 모든 내용 긁어오기


#서점에서 갑자기 이벤트 당첨 : 비어있는 카트를 주고 나서 30초 시간동안 담을수 있는 모든 책을 선물로 준대
#다만 가장 윗줄에 있는 책은 담으면 안된대
#그러면 책 정보도 볼 새 없이 모든 책을 쓸어 담겠지 >> 웹 크롤링

#내일 학교에서 시험을 치는데, 여기 필기하고 싶은 내용을 A4용지에 치팅시트 작성 된대.딱 한장만.
#그러면 중요한 부분만 딱 축약해서 쓰겠지? 가공해서? >> 웹 스크래핑

#웹은 크게 3가지로 구성이 되어있음. 1. HTML 2. CSS 3. JS

#집을 지을때 뼈대가 HTML , 인테리어가 CSS, 사람이 들어와서 살때 다양한 활동을 한다. 집을 살아있게 수행 > JS
#해당 강의에선 HTML위주로 함

#주의!!!!!!반드시 직접 해보면서 이해 해야댐. 왜? HTML 문서 구조는 페이지마다 시시각각 바뀌기 때문. 변경된 소스코드 계속 개선.
