#include <stdio.h>
 
int main()
{}


// 오늘 배운것
// 조건문 안에 = 말고 ==을 쓰도록 한다! 반드시..
// if나 else나 ; 붙이지 말고 {} 중괄호 똑띠 채워주기
// C언어는 0을 거짓으로 인식한다.
// &&을 써서 조건문에 조건식 여러개 작성 가능.
// C 언어에서는 비교 연산자가 참이면 1, 거짓이면 0이 나옵니다. 여기서는 num1이 10이므로 결과는 다음과 같습니다.


// 02.04
// case 다음에는 반드시 값(리터럴)이 와야 하며 변수나 조건식은 올 수 없습니다.
// switch 안에서 break가 제대로 작동하지 않는 문제?
// 단, 중괄호 안에 선언된 변수 num2는 case 1: 안에서만 사용할 수 있고 case 2:나 switch 바깥에서는 사용할 수 없습니다.
// switch에 세미콜론 붙이지 마!!!
// switch 판별식에 '문자 하나'도 가능 (char)


//for문에서 변수 2개 쓰는 경우 주의깊게 학습하라.
//for(;;) 처럼 빈칸이 의미하는것? 